R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
	static const uint8_t gsc_secTotalCount = (sizeof(SectorTable) / sizeof(SectorTable[0]));

#endif /* (FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx) */

/* PVD Flag. */
static volatile uint8_t gs_lowVoltage;

/* ****************************************************** */


void 
Cus_Flash_Lock( void )
{
	uint32_t FLASH_CR_RegTemp = FLASH->CR;

	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) != 0 )    return;   /* Has already be locked. Return. */

	uint32_t timeout = Cus_Flash_GetSpinCount(100);
	while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout )
	{
		__nop();
	}
	if ( !timeout )
	{
		/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
		Cus_FLASH_LockFailed_Hook();
		return;
	}

	/* FLASH_CR Lock bit set. */
	FLASH->CR |= FLASH_CR_LOCK_Msk;

	FLASH_CR_RegTemp = FLASH->CR;
	if ( !(FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) )
	{
		/* Lock failed! FLASH_CR Lock bit still reset.(write/read-back dismatch!) */
		Cus_FLASH_LockFailed_Hook();
	}
}



void 
Cus_Flash_Unlock( void )
{
	uint32_t FLASH_CR_RegTemp = FLASH->CR;

	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) == 0 )  return;   /* Has already be unlocked. Return. */

	uint32_t timeout = Cus_Flash_GetSpinCount(100);
	while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout )
	{
		__nop();
	}
	if ( !timeout )
	{
		/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
		Cus_FLASH_UnlockFailed_Hook();
		return;
	}

	/* Start Flash unlock sequence by writing KEY1 to FLASH_KEYR. */ 
	FLASH->KEYR = FLASH_KEYR_KEY1;    
	__DSB();

	/* Writing the last KEY Code(KEY2) to FLASH_KEYR. */
	FLASH->KEYR = FLASH_KEYR_KEY2;    

	FLASH_CR_RegTemp = FLASH->CR;
	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) )   
	{
		/* Unlock failed! FLASH_CR Lock bit still set. (write/read-back dismatch!) */
		Cus_FLASH_UnlockFailed_Hook();
	}
}



bool 
Cus_Flash_CalibrateLatency( void )
{
	SystemCoreClockUpdate();
	uint32_t desire_Latancy = ((FLASH->ACR) & 0x07UL);

	#if (DEVICE_STM32F1xx)
		if ( (SystemCoreClock > 0) && (SystemCoreClock <= SYSTEMCLOCK_24Mhz) )
		{
			if ( desire_Latancy == 0x00 )   return true;
			else  desire_Latancy = 0x00;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_24Mhz) && (SystemCoreClock <= SYSTEMCLOCK_48Mhz) )
		{
			if ( desire_Latancy == 0x01 )   return true;
			else desire_Latancy = 0x01;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_48Mhz) && (SystemCoreClock <= SYSTEMCLOCK_72Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) )  return true;
			else desire_Latancy = ((0x01UL) << 1);
		}
		else 
		{
			return false;               // 时钟错误. 不在范围内.
		}
	#endif // DEVICE_STM32F1xx

	#if (DEVICE_STM32F4xx)
		if ( (SystemCoreClock > 0) && (SystemCoreClock <= SYSTEMCLOCK_30Mhz) )
		{
			if ( desire_Latancy == 0x00 )   return true;
			else desire_Latancy = 0x00;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_30Mhz) && (SystemCoreClock <= SYSTEMCLOCK_60Mhz) )
		{
			if ( desire_Latancy == 0x01 )   return true;
			else desire_Latancy = 0x01;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_60Mhz) && (SystemCoreClock <= SYSTEMCLOCK_90Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) )  return true;
			else desire_Latancy = ((0x01UL) << 1);
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_90Mhz) && (SystemCoreClock <= SYSTEMCLOCK_120Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) | 0x01UL )  return true;
			else desire_Latancy = ((0x01UL) << 1) | 0x01UL;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_120Mhz) && (SystemCoreClock <= SYSTEMCLOCK_150Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 2) )  return true;
			else desire_Latancy = ((0x01UL) << 2);
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_150Mhz) && (SystemCoreClock <= SYSTEMCLOCK_168Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 2) | 0x01UL )  return true;
			else desire_Latancy = ((0x01UL) << 2) | 0x01UL;
		}
		else 
		{
			return false;       // 时钟错误. 不在范围内.
		}
	#endif // DEVICE_STM32F4xx

	FLASH->ACR = (FLASH->ACR & ~0x07UL) | desire_Latancy;

	return ((FLASH->ACR & 0x07UL) == desire_Latancy);
}



/**
 * @brief 根据系统时钟计算自旋等待的循环次数（粗略估算）
 * @param ms 超时毫秒数
 * @return 循环次数（每个循环约 5~6 个指令周期）
 */
static uint32_t 
Cus_Flash_GetSpinCount( uint32_t ms )
{
	// 估算每个循环消耗的 CPU 周期数.
	const uint32_t cycles_per_loop = 5;

	uint32_t sysclk = SystemCoreClock;

	uint32_t total_cycles = (ms * sysclk) / 1000;

	return total_cycles / cycles_per_loop;
}



static Cus_Flash_State_t 
Cus_Flash_WaitBusy( uint32_t timeout_ms )
{
	uint32_t timeout = Cus_Flash_GetSpinCount(timeout_ms);
	while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout ) { __nop(); }

	#if (DEVICE_STM32F4xx)
		static const uint32_t errorMask = FLASH_SR_PGAERR_Msk | FLASH_SR_PGPERR_Msk | FLASH_SR_PGSERR_Msk | FLASH_SR_WRPERR_Msk;
	#else
		static const uint32_t errorMask = FLASH_SR_PGERR_Msk | FLASH_SR_WRPRTERR_Msk;
	#endif /* DEVICE_STM32F4xx */

	if ( FLASH->SR & FLASH_SR_BSY_Msk ) return CUS_FLASH_TIMEOUT;

	if ( FLASH->SR & errorMask ) 
	{
		/* Clear error flag and return. */
		FLASH->SR |= errorMask;
		return CUS_FLASH_ERROR;
	}

	return CUS_FLASH_OK;
}



Cus_Flash_State_t 
Cus_Flash_WriteBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Buffer_Size )
{
	/* Check if the parameter is valid. */
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || !pData || Buffer_Size == 0 )   
		return CUS_FLASH_PARAMETER;

	if ( (StartAddress & 0x01UL) )   
	{
		/* The Addr must aligned to half-word. */
		return CUS_FLASH_ALIGNED_ERR;
	}

	/* Check if the area is writable. */
	if ( !Cus_Flash_IsValid(StartAddress, Buffer_Size) )
		return CUS_FLASH_NOT_ERASED;

	Cus_Flash_State_t hReturn =  Cus_Flash_WaitBusy(50);
	if ( hReturn != CUS_FLASH_OK )
	{
		/* The BUS is still busy. Return. */
		return hReturn;
	}

	/* Low voltage state not recovered. Erase operation not allowed. */
	if ( gs_lowVoltage )
		return CUS_FLASH_LOW_VOLTAGE_ERR;

	Cus_Flash_Unlock();

	/* Set FLASH_CR PG Bit. */
	FLASH->CR |= FLASH_CR_PG_Msk;

	#if (DEVICE_STM32F4xx)
		/* If the Device is F4 serial. Set FLASH_CR PSIZE Bits. (x16) */
		FLASH->CR = ((FLASH->CR & ~FLASH_CR_PSIZE_Msk) | (0x01UL << FLASH_CR_PSIZE_Pos));
	#endif /* DEVICE_STM32F4xx */

	/* hWordCount is always rounded up to an even number.  */
	uint32_t hWordCount = ((Buffer_Size + 1) / 2);

	volatile uint16_t *flash = (volatile uint16_t *)StartAddress;
	for( uint32_t index = 0; index < hWordCount; index++ )
	{
		uint16_t hw;
		if ( (index == hWordCount - 1) && ((Buffer_Size & 0x01UL) != 0) )
		{
			/* Size is odd. Handle the last half-word separately. */
			hw = pData[index * 2] | 0xFF00UL;
		}
		else 
		{
			/* Normal half-word case. */
			hw = ((uint16_t)pData[index * 2] | ((uint16_t)pData[index * 2 + 1] << 8));
		}

		*flash++ = hw;
		hReturn = Cus_Flash_WaitBusy(50);
		if ( hReturn != CUS_FLASH_OK )
		{
			/* Reset FLASH_CR. Return. */
			FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
			Cus_Flash_Lock();
			return hReturn;
		}
	}

	if ( !Cus_Flash_VerifyBuffer(StartAddress, pData, Buffer_Size) )
	{
		/* Verify error. Inform upper layer and return. */
		FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
		Cus_Flash_Lock();
		Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Buffer_Size);
		return CUS_FLASH_VERIFY_ERR;
	}

	FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
	Cus_Flash_Lock();
	return CUS_FLASH_OK;
}



bool 
Cus_Flash_VerifyBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Size )
{
	/* Check if the parameter is valid. */
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || !pData || Size == 0 )  
		return false;

	if ( !(StartAddress & 0x03UL) && !(Size % 4) && !((uint32_t)pData & 0x03UL) )
	{
		/*  4-byte aligned. Use word access for faster verification. */
		uint32_t *flash = (uint32_t *)StartAddress;
		uint32_t *pSrc = (uint32_t *)pData;
		for( uint32_t index = 0; index < (Size / 4); index++ )
		{
			if ( *flash++ != *pSrc++ )
			{
				/* Verification failed. Word mismatch detected. */
				Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Size);
				return false;
			}
		}
	}
	else 
	{
		/* Not 4-byte aligned. Fall back to byte-by-byte verification.  */
		for( uint32_t i = 0; i < Size; i++ )
		{
			if ( *((uint8_t *)StartAddress + i) != pData[i] )   
			{
				/* Verification failed. Byte mismatch detected. */
				Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Size);
				return false;
			}
		}
	}

