R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
	return true;
}



bool 
Cus_Flash_IsValid( uint32_t StartAddress, uint32_t Size )
{
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || Size == 0 )  
		return false;

	if ( !(StartAddress & 0x03UL) && !(Size % 4) )
	{
		/* 4-byte aligned. Use x32 for faster action. */
		uint32_t *flash = (uint32_t *)StartAddress;
		for( uint32_t index = 0; index < (Size / 4); index++ )
		{
			if ( *flash++ != UINT32_MAX )
			{
				/* Area is not all 0xFF (not erased). May contain existing data. Mark as unavailable and return. */
				return false;
			}
		}
	}
	else 
	{
		/* Not 4-byte aligned. Fall back to byte-by-byte verification. */
		for( uint32_t i = 0; i < Size; i++ )
		{
			if ( *((uint8_t *)StartAddress + i) != UINT8_MAX )   
			{
				return false;
			}
		}
	}

	return true;
}



Cus_Flash_State_t 
Cus_Flash_PVDConfig( Cus_Flash_PVD_t PVDLevel )
{
	/* Check if the PVDLEvel valid. */
	if ( PVDLevel > CUS_FLASH_PVD_LEVEL7 )
		return CUS_FLASH_PARAMETER;

	/* Set PWR_CR PLS Bits. */
	PWR->CR |= (PVDLevel << PWR_CR_PLS_Pos);

	/* Enable PVD NVIC and set priority. */
	NVIC_EnableIRQ(PVD_IRQn);
	NVIC_SetPriority(PVD_IRQn, 0);
}



void 
Cus_Flash_PVDSet( void )
{
	/* If PVD is enabled, place this API in the PVD ISR. */
	gs_lowVoltage = 1;
}



void 
Cus_Flash_PVDClr( void )
{
	/* Clear the PVD low voltage flag. */
	gs_lowVoltage = 0;
}



#if defined(FLASH_TYPEERASE_PAGES) && (DEVICE_STM32F1xx)

	Cus_Flash_State_t 
	Cus_Flash_ErasePage( uint32_t PageAddress )
	{
		/* Check if the parameter is valid. */
		if ( (PageAddress < FLASH_BASE) || (PageAddress >= FLASH_END_ADDR) )  
			return CUS_FLASH_PARAMETER;

		/* Check if the address is page-aligned. */
		if ( (PageAddress % CUS_FLASH_BYTE_PER_PAGE) )   
			return CUS_FLASH_PARAMETER;     

		/* Prevent Low-Voltage operation. */
		if ( gs_lowVoltage )
			return CUS_FLASH_LOW_VOLTAGE_ERR;

		Cus_Flash_State_t hReturn = Cus_Flash_WaitBusy(50);
		if ( hReturn != CUS_FLASH_OK )
		{
			/* BUS still busy. Return. */
			return hReturn;
		}

		Cus_Flash_Unlock();

		/* Set FLASH_CR PER Bit. */
		FLASH->CR |= FLASH_CR_PER_Msk;

		/* Set the page that will be erased in FLASH_AR. */
		FLASH->AR = PageAddress;

		/* Start erasing. (Set FLASH_CR STRT Bit) */
		FLASH->CR |= FLASH_CR_STRT_Msk;

		hReturn = Cus_Flash_WaitBusy(FLASH_ERASE_TIMEOUT_MS);
		if ( hReturn != CUS_FLASH_OK )
		{
			Cus_FLASH_EraseFailed_Hook();
			Cus_Flash_Lock();
			return hReturn;
		}

		/* Clear PER Bit. */
		FLASH->CR &= ~FLASH_CR_PER_Msk;

		/* Normal back. */
		Cus_Flash_Lock();
		return CUS_FLASH_OK;
	}



	uint32_t 
	Cus_Flash_GetPageAddress( uint32_t page_index )
	{
		/* Check if the page_index valid. */
		if ( (FLASH_BASE + page_index * CUS_FLASH_BYTE_PER_PAGE) >= FLASH_END_ADDR )   
			return 0;

		return (uint32_t)(FLASH_BASE + ( page_index * CUS_FLASH_BYTE_PER_PAGE ));
	}



	uint32_t 
	Cus_Flash_GetPageStart( uint32_t Address )
	{
		if ( Address < FLASH_BASE || Address > FLASH_END_ADDR )   
			return 0;
		
		if ( (Address % CUS_FLASH_BYTE_PER_PAGE) == 0 )  
		{
			/* Already a page start address. Return */
			return Address;  
		} 

		return Cus_Flash_GetPageAddress( ((Address - FLASH_BASE) / CUS_FLASH_BYTE_PER_PAGE) );
	}



	Cus_Flash_State_t 
	Cus_Flash_WritePage( Cus_Flash_PageReq_t *pPage )
	{
		/* Check if the parameter valid. */
		if ( !pPage || pPage->PageStartAddress < FLASH_BASE || pPage->PageStartAddress >= FLASH_END_ADDR )
			return CUS_FLASH_PARAMETER;

		if ( !pPage->pBuffer || !(pPage->bufSize) )
			return CUS_FLASH_PARAMETER;

		/* Cross-page writes are not allowed. */
		if ( (pPage->Offset + pPage->bufSize) >= CUS_FLASH_BYTE_PER_PAGE )
			return CUS_FLASH_NOSPACE_ERR;

		/* Prevant Low-Voltage operation. */
		if ( gs_lowVoltage )
			return CUS_FLASH_LOW_VOLTAGE_ERR;

		Cus_Flash_State_t hReturn = Cus_Flash_WriteBuffer((pPage->PageStartAddress + pPage->Offset), pPage->pBuffer, pPage->bufSize);
		if ( hReturn != CUS_FLASH_OK )
		{
			/* Write error. */
			return hReturn;
		}

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_Flash_ReadPage( Cus_Flash_PageReq_t *pPage )
	{
		if ( !pPage || !pPage->pBuffer || !pPage->bufSize )
			return CUS_FLASH_PARAMETER;

		if ( pPage->PageStartAddress < FLASH_BASE || pPage->PageStartAddress > FLASH_END_ADDR )
			return CUS_FLASH_PARAMETER;

		/* Read must be within a single page. Cross-page reads are not supported. */
		if ( (pPage->Offset + pPage->bufSize) > CUS_FLASH_BYTE_PER_PAGE )
			return CUS_FLASH_PARAMETER;

		if ( !((pPage->PageStartAddress + pPage->Offset) & 0x03UL) && !((uint32_t)pPage->pBuffer & 0x03UL) && !(pPage->bufSize & 0x03UL) )
		{
			/* Aligned to 4-Bytes. Use x32 for faster. */
			uint32_t *pRecv = (uint32_t *)pPage->pBuffer;
			uint32_t *flash = (uint32_t *)(pPage->PageStartAddress + pPage->Offset);
			for( uint32_t index = 0; index < (pPage->bufSize / 4); index++ )
			{
				*pRecv++ = *flash++;
			}
		}
		else 
		{
			for( uint32_t index = 0; index < pPage->bufSize; index++ )
			{
				pPage->pBuffer[index] = ((uint8_t *)(pPage->PageStartAddress + pPage->Offset))[index];
			}
		}

		if ( !Cus_Flash_VerifyBuffer((pPage->PageStartAddress + pPage->Offset), pPage->pBuffer, pPage->bufSize) )
		{
			/* Read verification failed. Notify upper layer and return. */
			Cus_FLASH_VerifyBufferFailed_Hook((pPage->PageStartAddress + pPage->Offset), pPage->pBuffer, pPage->bufSize);
			return CUS_FLASH_VERIFY_ERR;
		}

		return CUS_FLASH_OK;
	}



	int16_t 
	Cus_Flash_GetPageIndex( uint32_t Address )
	{
		if ( Address < FLASH_BASE || Address > FLASH_END_ADDR )   
			return -1;

		return (int16_t)((Address - FLASH_BASE) / CUS_FLASH_BYTE_PER_PAGE);
	}



	int16_t 
	Cus_Flash_GetTotalPages( void )
	{
		return (int16_t)( (FLASH_END_ADDR - FLASH_BASE) / CUS_FLASH_BYTE_PER_PAGE );
	}



	int32_t 
	Cus_Flash_GetRemainPages( uint32_t PageAddress )
	{
		if ( PageAddress < FLASH_BASE || PageAddress > FLASH_END_ADDR )   
			return -1;
		
		/* The address must be page-aligned. */
		if ( (PageAddress % CUS_FLASH_BYTE_PER_PAGE) )
			return -1;

		return (int32_t)( (FLASH_END_ADDR - PageAddress) / CUS_FLASH_BYTE_PER_PAGE );
	}



	int16_t 
	Cus_Flash_ErasePages( uint32_t PageStartAddress, uint16_t PageCount )
	{
		if ( PageStartAddress < FLASH_BASE || PageStartAddress > FLASH_END_ADDR )   
			return -1;

		/* PageStartAddress must be page-aligned. */
		if ( (PageStartAddress % CUS_FLASH_BYTE_PER_PAGE) )
			return -2;

		/* Get remain pages. */
		uint16_t PagesRemain = Cus_Flash_GetRemainPages(PageStartAddress);
		uint16_t PagesWaitToBeErase = PageCount;

		/* Requested page count exceeds remaining pages. Return. */
		if ( PagesWaitToBeErase > PagesRemain )   
			return -3;

		int16_t CurrectPage = Cus_Flash_GetPageIndex(PageStartAddress);
		uint16_t SuccessFulEraseCount = 0;

		for( uint16_t i = 0; i < PagesWaitToBeErase; i++ )
		{
			if ( Cus_Flash_ErasePage(Cus_Flash_GetPageAddress((uint32_t)CurrectPage + i)) != CUS_FLASH_OK )
			{
				/* Erase error occurred during batch. Return the number of pages successfully erased. */
				return SuccessFulEraseCount;
			}
			SuccessFulEraseCount++;
		}

		return PageCount;
	}

#endif // FLASH_TYPEERASE_PAGES



