R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
			/* Middle Spot Check. */
			for ( uint32_t offset = 128; offset < waitCheckBytes - 4; offset += CUS_CHECK_INTERVAL )
				if ( pData[offset] != 0xFF ) goto NOT_ERASED;

			/* Last 4 Bits Check. */
			for ( int i = 0; i < 4; i++ )
        		if ( pData[waitCheckBytes - 4 + i] != 0xFF ) goto NOT_ERASED;
		}

		Cus_Flash_Unlock();

		/* Set FLASH_CR PG bit. */
		FLASH->CR |= FLASH_CR_PG_Msk;

		/* Enable x32 Program. PSIZE=0b10 */
		FLASH->CR = ((FLASH->CR & ~FLASH_CR_PSIZE_Msk) | (0x02UL << FLASH_CR_PSIZE_Pos));

		uint32_t dataBlockStartAddr = (pRequest->pSector->secStartAddr + pRequest->Offset);
		#if (CUS_FLASH_USE_MANAGER)
			/* Manager feature. Prepare the data control block. */
			desc_t title = { 0 };
			title.Magic = CUS_MANAGER_MAGIC;
			title.validFlag = 0xFFFF;	/* FFFF=Data Valid. */
			title.dataStartAddr = (pRequest->pSector->secStartAddr + pRequest->Offset + sizeof(desc_t));
			title.Size = pRequest->bufSize;
			title.Type = pRequest->dataType;
			memcpy(title.Desc, pRequest->desc, sizeof(pRequest->desc));

			/* Update data block write addr. */
			dataBlockStartAddr = title.dataStartAddr;

			/* Write the control block. (Word) */
			uint32_t *src_ptr = (uint32_t *)&title;
			volatile uint32_t *desc_ptr = (volatile uint32_t *)(pRequest->pSector->secStartAddr + pRequest->Offset);
			uint8_t wordCount = sizeof(desc_t) / 4;
			
			for( uint8_t index = 0; index < wordCount; index++ )
			{
				desc_ptr[index] = src_ptr[index];

				/* Wait BSY clear and check Status Register. */
				if ( Cus_Flash_WaitBusy(50) != CUS_FLASH_OK )	goto PG_ERR;
			}

			/* Verify the control block if be written correctly. */
			if ( !Cus_Flash_VerifyBuffer((pRequest->pSector->secStartAddr + pRequest->Offset), (uint8_t *)src_ptr, sizeof(desc_t)) )
				goto VERIFY_ERR;
		#endif /* CUS_FLASH_USE_MANAGER */

		uint16_t dataCount_W = 0;
		uint8_t remainWaitToBeHandle = 0;
		if ( (pRequest->bufSize % 4) == 0 )
		{
			/* Buffer size is word-aligned. No tail bytes (1~3) need to be processed. */
			dataCount_W = pRequest->bufSize / 4;
		}
		else 
		{
			/* Buffer size is not word-aligned. Tail bytes (1~3) need to be handled. */
			dataCount_W = ((pRequest->bufSize / 4) + 1);
			remainWaitToBeHandle = 1;
		}

		/* Write user data. */
		volatile uint32_t *user = (volatile uint32_t *)dataBlockStartAddr;
		for( uint16_t index = 0; index < dataCount_W; index++ )
		{
			if ( remainWaitToBeHandle && (index == (dataCount_W - 1)) )
			{
				/* Handle the last 1 ~ 3 Bytes. */
				uint8_t remainByteNum = (pRequest->bufSize % 4);
				uint8_t remainStartIndex = (pRequest->bufSize - remainByteNum);
				uint32_t LastWord = 0;
				switch (remainByteNum)
				{
					case 1: memcpy(&LastWord, &pRequest->pBuffer[remainStartIndex], 1); LastWord |= 0xFFFFFF00UL; break;
					case 2: memcpy(&LastWord, &pRequest->pBuffer[remainStartIndex], 2); LastWord |= 0xFFFF0000UL; break;
					case 3: memcpy(&LastWord, &pRequest->pBuffer[remainStartIndex], 3); LastWord |= 0xFF000000UL; break;

					default:  goto PG_ERR;
				}

				/* Write the last word. */
				*user = LastWord;

				/* Wait BSY clear and check Status Register. */
				if ( Cus_Flash_WaitBusy(50) != CUS_FLASH_OK )	goto PG_ERR;

				goto SUCCESS;
			}

			uint32_t word;
			memcpy(&word, &pRequest->pBuffer[index * 4], 4);
			*user = word;

			/* Wait BSY clear and check Status Register. */
			if ( Cus_Flash_WaitBusy(50) != CUS_FLASH_OK )	goto PG_ERR;

			user++;
		}

	SUCCESS:	
		/* Verify The data block. */
		if ( !Cus_Flash_VerifyBuffer(dataBlockStartAddr, pRequest->pBuffer, pRequest->bufSize) )	goto VERIFY_ERR;

		Cus_Flash_Lock();
		return CUS_FLASH_OK;

	NOT_ERASED:
		Cus_FLASH_WriteSectorFailed_Hook(pRequest->pSector);
		return CUS_FLASH_NOT_ERASED;

	PG_ERR:
		Cus_Flash_Lock();
		Cus_FLASH_WriteSectorFailed_Hook(pRequest->pSector);
		return CUS_FLASH_ERROR;

	VERIFY_ERR:
		Cus_Flash_Lock();
		Cus_FLASH_VerifyBufferFailed_Hook(dataBlockStartAddr, pRequest->pBuffer, pRequest->bufSize);
		return CUS_FLASH_VERIFY_ERR;
	}



	Cus_Flash_State_t 
	Cus_Flash_ReadSector( const Cus_Flash_SecReq_t *pReq )
	{
		if ( !pReq || !pReq->pBuffer || !pReq->bufSize || !pReq->pSector )	
			return CUS_FLASH_PARAMETER;

		/* Verify that read size does not exceed the current sector boundary.  */
		if ( (pReq->Offset + pReq->bufSize) > pReq->pSector->secSize )
			return CUS_FLASH_PARAMETER;

		/* Get the Read Start Addr and Recv Start. */
		uint32_t *readStart = (uint32_t *)(pReq->pSector->secStartAddr + pReq->Offset);
		uint32_t *recvStart = (uint32_t *)pReq->pBuffer;

		/* Get the Read Word nums. */
		uint32_t remainBytes = (pReq->bufSize % 4);
		uint32_t wordNum = (pReq->bufSize / 4);
		uint8_t remainNeedBeHandled = 0;
		if ( remainBytes )
			remainNeedBeHandled = 1;

		/* Start read data in specific region. */
		for( uint32_t Wsize = 0; Wsize < wordNum; Wsize++ )
			*recvStart++ = *readStart++;

		/* If the Remains need to be processed. */
		if ( remainNeedBeHandled )
		{
			memcpy(recvStart, readStart, remainBytes);
		}

		return CUS_FLASH_OK;
	}

#endif /* (FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx) */


#if (CUS_FLASH_USE_MANAGER)

	Cus_Flash_State_t 
	Cus_FlashMgr_Init( FlashMgr_Instance_t *instance, uint32_t start_addr, uint32_t end_addr )
	{
		/* Check if the record table is full. */
		if ( gs_ActivateCount >= FLASH_MGR_MAX_INSTANCES )
			return CUS_FLASH_OVFLW_ERR;

		/* Ensure that the parameter is Valid. */
		if ( start_addr < FLASH_BASE || start_addr > FLASH_END_ADDR || !instance )
			return CUS_FLASH_PARAMETER;
		
		if ( end_addr < FLASH_BASE || end_addr > FLASH_END_ADDR )
			return CUS_FLASH_PARAMETER;

		/* Ensure the Addr is aligned to 4 Bytes. */
		if ( (start_addr & 0x03) || (end_addr & 0x03) )
			return CUS_FLASH_ALIGNED_ERR;

		/* Check for overlapping regions in the managed memory area. */
		for( uint8_t index = 0; index < gs_ActivateCount; index++ )
		{
			FlashMgr_Instance_t *other = gs_ActivateMgr[index];
			if ( (start_addr < other->mgrEndAddr) && (other->mgrStartAddr < end_addr) )
			{
				/* Overlapping managed region detected with an existing instance. Return. */
				return CUS_FLASH_OVERLAP_ERR;
			}
		}
		
		/* Init the gs_recordCount and gs_lowestFreeAddr. */
		instance->mgrRecordCount = 0;
		instance->mgrLowestFreeAddr = 0;

		/* Scan the entire managed area for valid data. */
		/* Start address and size are 4-byte aligned. Access as 32-bit words (size/4), no tail bytes. */
		uint32_t scanCount_W = ((end_addr - start_addr) / 4);
		uint32_t *flash = (uint32_t *)start_addr;
		uint16_t totalCnt = FLASH_MGR_MAX_RECORDS;
		uint8_t flash_step = (sizeof(desc_t) / 4);
		#define UINT_TO_DESC	((desc_t *)flash)	

		for( uint32_t index = 0; index < scanCount_W; index++ )
		{
			if ( (*flash == CUS_MANAGER_MAGIC) && (UINT_TO_DESC->validFlag != 0xFFFEUL) )
			{
				if ( instance->mgrRecordCount >= FLASH_MGR_MAX_RECORDS )
				{
					/* Error. Buffer Overflow. */
					totalCnt++;
					flash += flash_step;
					index += (flash_step - 1);
					continue;
				}

				/* Find one valid record. add to Recored Poll(gs_records). */
				FlashMgr_Record_t record;
				record.msgStartAddr = UINT_TO_DESC->dataStartAddr;
				record.msgSize = UINT_TO_DESC->Size;
				record.msgType = UINT_TO_DESC->Type;
				memcpy(record.msgDetail, UINT_TO_DESC->Desc, sizeof(record.msgDetail));

